[
    {
        "title": "1 - ¿Qué es PHP?",
        "subtitle": "PHP (acrónimo de \"PHP: Hypertext Preprocessor\") es ...",
        "content": "<div>\n\n<p>PHP (acrónimo de \"PHP: Hypertext Preprocessor\") es un lenguaje interpretado de alto nivel embebido en páginas HTML y ejecutado en el servidor.</p>\n\n<p>Hay que entender primero como funciona la solicitud de páginas en un navegador para comenzar a programar en PHP.</p>\n\n<h3>Comunicación entre el cliente y el servidor sin PHP:</h3>\n<p>1 - Tipeamos en la barra del navegador la dirección y el archivo a solicitar.</p>\n\n<p>2 - El web browser (navegador) envía el mensaje a través de Internet a la computadora, por ejemplo  www.lanacion.com/pagina1.htm solicitando la página (archivo) pagina1.htm</p>\n\n<p>3 - El web server (servidor web, que puede ser el Apache, IIS, etc.) que es un programa que se ejecuta en la máquina www.lanacion.com, recibe el mensaje y lee el archivo solicitado desde el disco duro.</p>\n\n<p>4 - El servidor web envía el archivo solicitado por el navegador tal cual está en el disco duro.</p>\n\n<p>5 - El navegador muestra en pantalla el archivo que envió el servidor web. </p>\n\n<p>Este proceso siempre es el mismo cuando hablamos de páginas estáticas (páginas que no cambian), cualquiera sea el cliente que solicita la página el contenido siempre será el mismo.<br>\n</p><p>La única forma que el contenido del archivo cambie es que el administrador de ese sitio web edite el contenido del archivo pagina1.htm y haga modificaciones.</p>\n\n\n\n<h3>Comunicación entre el cliente y el servidor con PHP:</h3>\n<p>1 - Tipeamos en la barra del navegador la dirección y el archivo a solicitar.</p>\n\n<p>2 - El web browser (navegador) envía el mensaje a través de Internet a la computadora llamada www.lanacion.com solicitando la página (archivo) pagina1.php</p>\n\n<p>3 - El web server (servidor web, que puede ser el Apache, IIS, etc.), recibe el mensaje y al ver que la extension es \"php\" solicita al interprete de PHP (que es otro programa que se ejecuta en el servidor web) que le envíe el archivo.</p>\n\n<p>4 - El intérprete PHP lee desde el disco el archivo pagina1.php</p>\n\n<p>5 - El intérprete PHP ejecuta los comandos contenidos en el archivo y eventualmente se comunica con un gestor de base de datos (ejemplos de ellos pueden ser MySql, MariaDB, Oracle, Informix, SQL Server, etc.) </p>\n\n<p>6 - Luego de ejecutar el programa contenido en el archivo envía éste al servidor web.</p>\n\n<p>7 - El servidor web envía la página al cliente que la había solicitado.</p>\n\n<p>8 - El navegador muestra en pantalla el archivo que envió el servidor web. </p>\n\n<p>Para aquellas personas que conocen otros lenguajes de programación (C - Java - C# - Pascal etc.) la salida de los resultados normalmente es la pantalla, en PHP la salida es la página HTML (luego ésta viaja por internet y llega al cliente que la solicitó)</p>\n\n</div>"
    },
    {
        "title": "2 - Instalación del entorno XAMPP",
        "subtitle": "Actualmente XAMPP es el entorno más popular de desar ...",
        "content": "<div>\n<p>Actualmente XAMPP es el entorno más popular de desarrollo con PHP. Este software contiene todo lo que necesitamos para probar en forma local en nuestro equipo los programas que codifiquemos en PHP.</p>\n\n<p>Procedemos a descargar XAMPP de la siguiente página: <a target=\"_blank\" href=\"https://www.apachefriends.org/es/index.html\">aquí</a>.</p><p> \n<img src=\"asset:assets/img/2_phpya1.jpg\"><br>\n\n\n</p><p>Luego de descargarlo procedemos a ejecutar el instalador:</p>\n<img src=\"asset:assets/img/2_phpya2.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Seleccionamos los programas mínimos que necesitamos para trabajar con PHP, MySQL, Apache y phpMyAdmin:</p>\n<img src=\"asset:assets/img/2_phpya3.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Elegimos el directorio donde se instalará\":</p>\n<img src=\"asset:assets/img/2_phpya4.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Luego comienza la instalación propiamente del software:</p>\n<img src=\"asset:assets/img/2_phpya5.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Una vez finalizada la instalación aparece un diálogo con un 'checkbox' para iniciar el programa XAMPP inmediatamente:</p>\n<img src=\"asset:assets/img/2_phpya6a.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Si dejamos chequeada la opción \"Do you want to start the Control Panel now?\" se inicia el XAMPP</p>\n<img src=\"asset:assets/img/2_phpya6.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Debemos iniciar los programas \"Apache\" y \"MySQL\" presionando los botones 'Start':</p>\n<img src=\"asset:assets/img/2_phpya7.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>Si el software está correctamente instalado y no hay conflicto con otros deberán aparecer en verde los paneles de estado.</p>\n<p>Siempre que codifiquemos y probemos los programas en PHP el programa XAMPP junto con 'Apache' y 'MySQL' deben estar ejecutandose.</p>\n<p>En el escritorio aparece un ícono del panel de control de XAMPP o podemos arrancarlo desde el directorio donde lo instalamos mediante el programa:</p>\n<img src=\"asset:assets/img/2_phpya8.jpg\" border=\"0\" alt=\"instalación de XAMPP\"><br>\n<p>El siguiente paso es probar nuestro primer programa en PHP.</p>\n\n<h3>Acotaciones</h3>\n<p>Existe otro entorno popular llamado WAMPSERVER que nos instala y administra PHP, MySQL y Apache.</p>\n<p>Si ya lo tiene instalado y ya está habituado a trabajar con él, no es necesario que instale el XAMPP.</p>\n<p>El entorno de WAMPSERVER lo puede descargar del sitio: \n<a target=\"_blank\" href=\"http://www.wampserver.com/en/\">WAMPSERVER</a>.</p><p> \n</div>"
    },
    {
        "title": "3 - Programa \"Hola Mundo\" en PHP",
        "subtitle": "En este curso suponemos que conoce los elementos pri ...",
        "content": "content"
    },
    {
        "title": "4 - Un programita mas util que \"Hola Mundo\"",
        "subtitle": "Un problema sencillo que se nos puede presentar ...",
        "content": "content"
    },
    {
        "title": "5 - Tipos de variables",
        "subtitle": "Los nombres de variables comienzan con el caracter ...",
        "content": "content"
    },
    {
        "title": "6 - Variables de tipo string",
        "subtitle": "Una variable de este tipo puede almacenar una serie ...",
        "content": "content"
    },
    {
        "title": "7 - Estructura condicional (if)",
        "subtitle": "Una variable de este tipo puede almacenar una serie ...",
        "content": "content"
    },
    {
        "title": "8 - Estructuras repetitivas (for - while - do/while)",
        "subtitle": "Las estructuras repetitivas son similares al lenguaje C ..",
        "content": "content"
    },
    {
        "title": "9 - Envío de datos de un FORMULARIO (controles text y submit)",
        "subtitle": "Una actividad fundamental en PHP es la recolección de datos ...",
        "content": "content"
    },
    {
        "title": "10 - FORMULARIO (control radio)",
        "subtitle": "Una actividad fundamental en PHP es la recolección de datos ...",
        "content": "content"
    },
    {
        "title": "11 - FORMULARIO (control checkbox)",
        "subtitle": "El control checkbox tiene dos estados: seleccionado ...",
        "content": "content"
    },
    {
        "title": "12 - FORMULARIO (control select)",
        "subtitle": "Veamos ahora como podemos rescatar desde PHP el elemento ...",
        "content": "content"
    },
    {
        "title": "13 - FORMULARIO (control textarea)",
        "subtitle": "El control HTML \"textarea\" se diferencia del \"text\" en que ...",
        "content": "content"
    },
    {
        "title": "14 - Vectores (tradicionales)",
        "subtitle": "Un Array es una colección de valores. Los array pueden ...",
        "content": "content"
    },
    {
        "title": "15 - Creación de un archivo de texto",
        "subtitle": "Una actividad fundamental es poder registrar información ...",
        "content": "content"
    },
    {
        "title": "16 - Lectura de un archivo de texto",
        "subtitle": "Para la lectura de un archivo de texto contamos ...",
        "content": "content"
    },
    {
        "title": "17 - Vectores (asociativos)",
        "subtitle": "Este tipo de vectores no es común a otros lenguajes ...",
        "content": "content"
    },
    {
        "title": "18 - Funciones en PHP",
        "subtitle": "La sintaxis para la definición de una función en PHP es ...",
        "content": "content"
    },
    {
        "title": "19 - Base de datos (MySQL)",
        "subtitle": "Uno de los empleos principales de PHP es el acceso a una base de datos ...",
        "content": "content"
    },
    {
        "title": "20 - INSERT (Alta de registros en una tabla)",
        "subtitle": "20 - INSERT (Alta de registros en una tabla) ...",
        "content": "content"
    },
    {
        "title": "21 - Listado (selección de registros de una tabla)",
        "subtitle": "Para recuperar datos desde MySQL o MariaDB debemos ...",
        "content": "content"
    },
    {
        "title": "22 - Consulta (selección de registros de una tabla)",
        "subtitle": "El proceso de consulta de datos de una tabla es similar al de listado ...",
        "content": "content"
    },
    {
        "title": "23 - DELETE (Baja de un registro en una tabla)",
        "subtitle": "El objetivo de este punto es el borrado de un registro de una tabla ...",
        "content": "content"
    },
    {
        "title": "24 - DELETE (Baja de todos los registros de una tabla)",
        "subtitle": "Vimos en el concepto anterior que podemos borrar una ...",
        "content": "content"
    },
    {
        "title": "25 - UPDATE (Modificación de un registro de una tabla)",
        "subtitle": "De las actividades con una tabla esta es la más larga ...",
        "content": "content"
    },
    {
        "title": "26 - INSERT (y consulta de otra tabla)",
        "subtitle": "En un primer paso vimos como efectuar el alta en la tabla alumnos ...",
        "content": "content"
    },
    {
        "title": "27 - Listado (selección de registros de varias tablas - INNER JOIN)",
        "subtitle": "Ahora veremos como imprimir todos los alumnos inscriptos a los cursos ...",
        "content": "content"
    },
    {
        "title": "28 - Función count de SQL",
        "subtitle": "Hay en MySQL funciones que nos permiten contar registros ...",
        "content": "content"
    },
    {
        "title": "29 - UPDATE (Modificación de un registro trabajando con dos tablas)",
        "subtitle": "Ahora complicaremos un poco la modificación de un registro ...",
        "content": "content"
    },
    {
        "title": "30 - Cláusula Group By de SQL",
        "subtitle": "Entre las muchas posibilidades que nos brinda SQL ...",
        "content": "content"
    },
    {
        "title": "31 - Parámetros en un hipervínculo",
        "subtitle": "Hasta ahora hemos visto como enviar datos de una página ...",
        "content": "content"
    },
    {
        "title": "32 - Paginación de registros",
        "subtitle": "En situaciones en las cuales una consulta retorna ...",
        "content": "content"
    },
    {
        "title": "33 - Subir un archivo al servidor (Upload)",
        "subtitle": "Una actividad común en un sitio es poder almacenar ...",
        "content": "content"
    },
    {
        "title": "34 - Creación y lectura de una cookie",
        "subtitle": "El protocolo HTTP es desconectado. Esto significa",
        "content": "content"
    },
    {
        "title": "35 - Borrado de una cookie",
        "subtitle": "Para borrar una cookie se debe llamar a la función setcookie",
        "content": "content"
    },
    {
        "title": "36 - Cookie de sesión",
        "subtitle": "Para crear una cookie que sólo tenga existencia mientras",
        "content": "content"
    },
    {
        "title": "37 - Variables de sesión ($_SESSION)",
        "subtitle": "Es otro método para hacer que variables estén disponibles",
        "content": "content"
    },
    {
        "title": "38 - Incluir un archivo externo (require_once)",
        "subtitle": "Hasta ahora hemos visto que un archivo contiene todo el código",
        "content": "content"
    },
    {
        "title": "39 - Redireccionar a otra página (header)",
        "subtitle": "Con PHP se puede implementar un pequeño programa",
        "content": "content"
    },
    {
        "title": "40 - Creación de imágenes dinámicas desde PHP",
        "subtitle": "Existe un conjunto de funciones que nos permite la creación",
        "content": "content"
    },
    {
        "title": "41 - Agregar imágenes dinámicas en un archivo HTML",
        "subtitle": "En un concepto anterior habíamos visto como crear un archivo gráfico",
        "content": "content"
    },
    {
        "title": "42 - Administración de fechas y horas (función date)",
        "subtitle": "La función date retorna un string con una fecha y hora",
        "content": "content"
    },
    {
        "title": "43 - Validación de una fecha ingresada por teclado (checkdate)",
        "subtitle": "Si disponemos en forma separada del día, mes y año hay",
        "content": "content"
    },
    {
        "title": "44 - Carga de una fecha en una tabla de MySQL",
        "subtitle": "Agregar a la tabla alumnos un campo llamado \"fechanac\"",
        "content": "content"
    },
    {
        "title": "45 - Formateo de datos en una página (printf)",
        "subtitle": "Hasta ahora siempre hemos impreso dentro de la página",
        "content": "content"
    },
    {
        "title": "46 - Formateo de datos y salida a un string (sprintf)",
        "subtitle": "Así como vimos que la función printf nos permite tener",
        "content": "content"
    },
    {
        "title": "47 - mysqli - POO (Programación Orientada a Objetos)",
        "subtitle": "En conceptos anteriores vimos un conjunto de funciones para el acceso",
        "content": "content"
    },
    {
        "title": "48 - mysqli (POO) - alta tabla rubros",
        "subtitle": "Implementaremos el alta de la tabla rubros utilizando la interfaz",
        "content": "content"
    },
    {
        "title": "49 - mysqli (POO) - listado tabla rubros",
        "subtitle": "Para recuperar datos de tablas disponemos de una clase",
        "content": "content"
    },
    {
        "title": "50 - mysqli (POO) - consulta tabla rubros",
        "subtitle": "Para consultar registros de una tabla debemos utilizar",
        "content": "content"
    },
    {
        "title": "51 - mysqli (POO) - borrado de un registro de la tabla rubros",
        "subtitle": "Para el borrado debemos primero localizar el registro a borrar",
        "content": "content"
    },
    {
        "title": "52 - mysqli (POO) - modificación de un registro de la tabla rubros",
        "subtitle": "Procederemos ahora a implementar el algoritmo para modificar",
        "content": "content"
    },
    {
        "title": "53 - mysqli (POO) - alta tabla articulos",
        "subtitle": "Ahora tenemos que implementar el alta en la tabla articulos",
        "content": "content"
    },
    {
        "title": "54 - mysqli (POO) - listado tabla articulos",
        "subtitle": "Ahora implementaremos el listado completo de la tabla",
        "content": "content"
    },
    {
        "title": "55 - mysqli (POO) - consulta tabla articulos",
        "subtitle": "Implementaremos el algoritmo para recuperar los datos",
        "content": "content"
    },
    {
        "title": "56 - mysqli (POO) - borrado de un registro de la tabla articulos",
        "subtitle": "Para borrar un artículo debemos implementar un formulario",
        "content": "content"
    },
    {
        "title": "57 - mysqli (POO) - modificación de un registro de la tabla articulos",
        "subtitle": "Para modificar los datos de un artículo implementaremos",
        "content": "content"
    },
    {
        "title": "58 - mysqli (POO) - panel para ABM de la tabla articulos",
        "subtitle": "Ahora implementaremos una serie de páginas para administrar",
        "content": "content"
    },
    {
        "title": "59 - mysqli (POO) - propiedad: affected_rows",
        "subtitle": "La propiedad affected_rows almacena la cantidad de filas",
        "content": "content"
    },
    {
        "title": "60 - mysqli (POO) - propiedad: insert_id",
        "subtitle": "Otra propiedad de amplio uso es insert_id, la misma",
        "content": "content"
    }
]